Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/ruby-omegat.tmx
Source language: en_us
Languages: pt_br

source: Modifying Repositories Succeeded
pt_br: A modificação dos repositórios foi concluída com sucesso

source: Nothing found: Network problem?
pt_br: Nada encontrado: Problemas de rede?

source: Check Repository list, as well as proxy settings.
pt_br: Verifique a lista de repositório e as configurações de proxy.

source: The plugin directory is not writable as this user.
pt_br: O diretório de plugin não tem permissão de escrita para este usuário.

source: Running the script/plugin command, please wait.
pt_br: Executando o comando script/plugin, por favor aguarde.

source: Select One Or More Repository
pt_br: Selecione um ou mais repositórios

source: Repositories
pt_br: Repositórios

source: Showing cached plugin list: Remote query in progress...
pt_br: Exibindo lista de plugins em cache: Consulta remota em progresso...

source: Uninstallation
pt_br: Desinstalando

source: Uninstallation Failed
pt_br: Falha na desinstalação

source: Uninstallation Succeeded
pt_br: A desinstalação terminou com sucesso

source: Upgrade Failed
pt_br: A atualização falhou

source: Upgrade Succeeded
pt_br: A atualização terminou com sucesso

source: &Add URL...
pt_br: &Adicionar URL...

source: &Find New...
pt_br: &Encontrar novo...

source: &Install
pt_br: &Instalar

source: Installed
pt_br: Instalado

source: &Search
pt_br: Pe&squisar

source: Settings
pt_br: Configurações

source: New Plugins
pt_br: Novos plugins

source: Configure &Proxies...
pt_br: Configurar &Proxies...

source: &Reload Plugins
pt_br: &Recarregar plugins

source: &Reload Repositories
pt_br: &Recarregar repositórios

source: U&ninstall
pt_br: Desi&nstalar

source: &Unregister
pt_br: &Desregistrar

source: Update &All
pt_br: &Atualizar todos

source: &Update
pt_br: &At&ualizar

source: New
pt_br: Novo

source: Repository
pt_br: Repositório

source: Plugin Installation Setting
pt_br: Configuração de instalação de Plugin

source: Specific revision
pt_br: Revisão específica:

source: Output Area
pt_br: Área de saída

source: Clean
pt_br: Limpar

source: Build
pt_br: Construir

source: Clean and Build
pt_br: Limpar e construir

source: Run
pt_br: Executar

source: Debug
pt_br: Depurar

source: Generate RDoc
pt_br: Gerar RDoc

source: Test
pt_br: Testar

source: Properties
pt_br: Propriedades

source: Auto Test
pt_br: Auto teste

source: Resolve Reference Problems...
pt_br: Resolver problemas de referências...

source: Open Project
pt_br: Abrir projeto

source: Creates a Ruby on Rails project from an existing Ruby on Rails application.
pt_br: Cria um projeto Ruby on Rails a partir de uma aplicação Ruby on Rails existente.

source: Ruby on Rails is an open-source web framework for Ruby.
pt_br: Ruby on Rails é um framework web para Ruby de código aberto.

source: Creates a new Rails RJS template.
pt_br: Cria um novo modelo RJS Rails.

source: Creates a new Ruby on Rails application.
pt_br: Cria uma nova aplicação Ruby on Rails application.

source: Empty RJS Template
pt_br: Modelo RJS vazio

source: Web Services
pt_br: Serviços Web

source: Sources
pt_br: Códigos-fonte

source: Compiling
pt_br: Compilação

source: Additional Compiler Options:
pt_br: Opções adicionais do compilador:

source: (e.g. -b -- see available flags below)
pt_br: (ex.: -b -- veja argumentos disponíveis abaixo)

source: Port Number:
pt_br: Número da porta:

source: &Browse...
pt_br: Explora&r...

source: Server &Port Number:
pt_br: Número da &porta do servidor:

source: &Working Directory:
pt_br: &Diretório de trabalho:

source: Brow&se...
pt_br: Pr&ocurar...

source: Browse Working Directory
pt_br: Procurar diretório de trabalho

source: &Ruby Options:
pt_br: Opções do &Ruby:

source: (e.g. -b)
pt_br: (ex.: -b)

source: &Select the main script:
pt_br: &Selecionar o script principal:

source: &Main scripts:
pt_br: &Scripts principais:

source: Select Main Class
pt_br: Selecionar classe principal

source: Browse Main Classes
pt_br: Procurar classes principais

source: <No Ruby files found>
pt_br: <Não foi encontrado nenhum arquivo Ruby>

source: Project Folder:
pt_br: Diretório do projeto:

source: Add Folder
pt_br: Adicionar diretório

source: <html><b>Folder Already Used in Project</b></html> Following folders you selected are already used in this or another project.
pt_br: <html><b>O diretório já está em uso no projeto </b></html> O diretório que você selecionou já está um uso por este ou outro projeto.

source: One package folder can only be used in one project in one package folder list (source packages or test packages).
pt_br: O diretório de pacote só pode ser utilizado em um projeto na lista de diretórios de pacote (pacotes de código-fonte ou teste).

source: Package folders already in use:
pt_br: Os diretórios de pacote já estão em uso em:

source: Those folders cannot be added to the project.
pt_br: Estes diretório não podem ser adicionados no projeto.

source: Add Source Folder
pt_br: Adicionar pasta de origem

source: Add Test Folder
pt_br: Adicionar pasta de teste

source: {0} (owned by {1})
pt_br: {0} (pertence a {1})

source: Initializing view, please wait ...
pt_br: Inicializando visualização, por favor aguarde...

source: Scanning in progress, please wait ...
pt_br: Análise em andamento, por favor aguarde ...

source: Label
pt_br: Rótulo

source: Add Folder...
pt_br: Adicionar diretório...

source: Source Folders:
pt_br: Diretórios de origem:

source: Test Folders:
pt_br: Diretórios de teste:

source: <html><p><strong>The "build-impl.xml" file was modified externally.</strong></p><br><p>The IDE automatically generates this file whenever you edit project<br>properties.
pt_br: <html><p><strong>O arquivo "build-impl.xml" foi modificado externamente.</strong></p><br><p>O IDE irá gerar automaticamente este arquivo sempre que você editar as propriedades do projeto.

source: If you proceed, "build-impl.xml" will be regenerated and<br><strong>any changes you have made manually will be lost</strong>.</p><br><p>Do you want to regenerate "build-impl.xml"?</p></html>
pt_br: Se você continuar, "build-impl.xml" será gerado novamente e <br><strong>quaiser modificações que você fizer manualmente serão perdidas</strong>.</p><br><p>Você deseja gerar novamente o "build-impl.xml"?</p></html>

source: Regenerate
pt_br: Gerar novamente

source: Edit Project Properties
pt_br: Editar propriedades do projeto

source: &Configuration:
pt_br: &Configuração:

source: &New...
pt_br: &Novo...

source: &Delete
pt_br: &Excuir

source: Profile Name:
pt_br: Nome do perfil:

source: Create New Profile
pt_br: Criar novo perfil

source: Configuration {0} already exists.
pt_br: A configuração {0} já existe.

source: &Encoding:
pt_br: &Codificando:

source: Environment:
pt_br: Ambiente:

source: Development
pt_br: Desenvolvimento

source: Testing
pt_br: Testando

source: Production
pt_br: Produção

source: &Rake Arguments:
pt_br: Argumentos do Rake:

source: (e.g. --dry-run)
pt_br: (ex.: --dry-run)

source: Rake Arguments
pt_br: Argumentos do Rake

source: Encoding
pt_br: Codificação

source: New Configuration
pt_br: Nova configuração

source: Ruby on Rails Application
pt_br: Aplicação Ruby on Rails

source: Ruby on Rails Application with Existing Sources
pt_br: Aplicação Ruby on Rails a partir de recursos existentes

source: Not a Ruby on Rails application directory
pt_br: Não é um diretório de aplicação Ruby on Rails

source: version 1.2.3
pt_br: versão 1.2.3

source: If using JRuby:
pt_br: Se utilizar JRuby:

source: JRuby does not bundle SSL support used by Rails.
pt_br: O JRuby não suporta o SSL embutido usado pelo Rails.

source: Proxy Settings...
pt_br: Configurações de proxy...

source: &Proxy Settings...
pt_br: Configurações de &proxy...

source: Install Rails
pt_br: Instalar Rails

source: &Details
pt_br: &Detalhes

source: Install JRuby OpenSSL Support
pt_br: Instalar suporte JRuby OpenSSL

source: Install JRuby &OpenSSL Support
pt_br: Instalar suporte JRuby &OpenSSL

source: Ruby on Rails Installation
pt_br: Instalação Ruby on Rails

source: Rails is not installed.
pt_br: Rails não está instalado.

source: Ruby is not configured correctly; check options | Ruby | Platform
pt_br: Ruby não está configurado corretamente; verifique opções | Ruby | Plataforma

source: Rails appears to be installed.
pt_br: O Rails parece estar instalado.

source: Install &Rails
pt_br: Instalar &Rails

source: Update Rails
pt_br: Atualizar Rails

source: Rails not found: {0}
pt_br: Rails não foi encontrado: {0}

source: Ruby Gems is not accessible
pt_br: O Ruby Gems não está acessível

source: Select Project Location
pt_br: Selecionar local do projeto

source: Creates new Ruby on Rails Application project
pt_br: Cria um novo projeto de aplicação Ruby on Rails

source: Creates new Ruby on Rails Application with Existing Sources
pt_br: Cria um novo projeto de aplicação Ruby on Rails com códigos-fonte existentes

source: Existing Sources
pt_br: Código-fonte existente

source: {0} of {1}
pt_br: {0} de {1}

source: Main Class name is not valid.
pt_br: O nome da classe principal não é válido.

source: Creating a project in filesystem root folder is not supported.
pt_br: Criar um projeto no diretório de sistema de arquivo do root não é suportado.

source: Browse Source Packages Folder
pt_br: Procurar pacotes de código-fonte

source: Browse Test Packages Folder
pt_br: Procurar pacotes teste de código-fonte

source: Specify the folders containing the source folders and Ruby unit test folders
pt_br: Especifique os diretórios contendo o código-fonte e as unidades de teste Ruby

source: Cannot place the project in a Project Folder that already contains {0}.
pt_br: Não é possível colocar o projeto em um diretório que já contenha {0}.

source: Project Folder was just in use.
pt_br: O diretório do projeto acabou de ser utilizado.

source: Please restart the IDE to reuse folder.
pt_br: Por favor, reinicie o IDE para reutilizá-lo.

source: NetBeans project
pt_br: Projeto NetBeans

source: "build.xml" file
pt_br: arquivo "build.xml"

source: "build" folder
pt_br: diretório "build"

source: "dist" folder
pt_br: diretório "dist"

source: "manifest.mf" file
pt_br: arquivo "manifest.mf"

source: Source Packages Folder {0} does not exist.
pt_br: O diretório de pacote de código-fonte {0} não existe.

source: Test Packages Folder {0} does not exist.
pt_br: O diretório de pacotes de teste {0} não existe.

source: Project Folder has to be located outside of the folder containing packages.
pt_br: O diretório do projeto deve estar em um local fora do diretório que contém os pacotes.

source: Specify a name and location for the existing Rails application
pt_br: Especifique um nome e um local para uma aplicação Rails existente

source: Set as Main Project
pt_br: Definir como projeto principal

source: Create Main Class
pt_br: Criar uma classe principal

source: Select checkbox to create main class in project.
pt_br: Selecione esta opção para criar uma classe principal no projeto.

source: &Create Main File
pt_br: &Criar um arquivo principal

source: Set as &Main Project
pt_br: Definir co&mo projeto principal

source: Project name
pt_br: Nome do projeto

source: Name of new project
pt_br: Nome do novo projeto

source: Project Location:
pt_br: Local do projeto:

source: Location of the project's root folder
pt_br: Local do diretório raiz dos projetos

source: Browse
pt_br: Procurar

source: Click the Browse button to open the project location chooser.
pt_br: Clique no botão Procurar para abrir a janela de seleção do local do diretório.

source: Select the folders that contain existing Java packages.
pt_br: Selecione os diretórios os quais contenham pacotes Java existentes.

source: Specify a name and location for the new project.
pt_br: Especifique um nome e um local para o novo projeto.

source: Specify the name of project's Main Class.
pt_br: Especifique o nome da classe principal do projeto.

source: <html><p><strong>The specified package folder contains compiled class files (*.class).</strong></p><br><p>Because the IDE generates compiled class files in</p><p>the "build" folder, it is recommended that you delete</p><p>the existing compiled class files.</p><br><p>Do you want do delete the class files now?</p></html>
pt_br: <html><p><strong>O diretório do pacote especificado contém arquivos de classe compilados (*.class).</strong></p><br><p>Porque o IDE gera arquivos de classe compilada no</p><p>diretório "build", é recomendável que você apague</p><p>os arquivos de classe compilada.</p><br><p>Você deseja apagar os arquivos de classe compilada agora?</p></html>

source: New Java Project with Existing Sources
pt_br: Novo projeto Java com código-fonte existente

source: Ignore
pt_br: Ignorar

source: Reading project properties
pt_br: Carregando propriedades do projeto

source: Creating new project
pt_br: Criando novo projeto

source: Preparing new project to be opened
pt_br: Preparando novo projeto para ser aberto

source: Installed version: {0}
pt_br: Versão instalada: {0}

source: &Database:
pt_br: Banco de &dados:

source: &Access Database Using JDBC
pt_br: &Acessar o banco de dados utilizando JDBC

source: Add &Rake Targets to Support App Server Deployment (.war)
pt_br: Adicionar destino &Rake para suportar servidores de aplicação Deployment (.war)

source: JDBC or WAR deployment requires JRuby as the selected Ruby interpreter
pt_br: O deployment JDBC ou WAR necessita que o JRuby esteja selecionado como interpretador Ruby

source: If Using JRuby:
pt_br: Se utilizar JRuby:

source: Chan&ge...
pt_br: &Modificar...

source: Ruby Interpreter:
pt_br: Interpretador Ruby:

source: The Ruby Interpreter is set for the entire IDE, not per project (in this version of NetBeans).
pt_br: O interpretador Ruby é definido em todo o IDE e não por cada projeto (nesta versão do NetBeans).

source: You can change the interpreter anytime by opening the Options dialog.
pt_br: Você pode modificar o interpretador a qualquer hora abrindo o diálogo de Opções.

source: Other (JDBC)
pt_br: Outro (JDBC)

source: {0} requires "Access Database Using JDBC" to be selected
pt_br: {0} precisa estar selecionado: "Acessar banco de dados utilizando JDBC"

source: Details
pt_br: Detalhes

source: This is a Irb window
pt_br: Esta é uma janela Irb

source: Ruby Projects
pt_br: Projetos Ruby

source: Supports plain Ruby projects
pt_br: Oferece suporte simples para projetos Ruby

source: Support for general Ruby projects
pt_br: Suporte para projetos Ruby em geral

source: Run Rake Task
pt_br: Executar tarefa Rake

source: Debug Rake Task
pt_br: Depurar tarefa Rake

source: Refresh List
pt_br: Atualizar lista

source: Runs "rake -T" to compute the actual list of valid targets, and update menus
pt_br: Executar "rake -T" para computar a lista atual de alvos válidos e atualizar menus

source: Refresh In Progress
pt_br: Atualização em progresso

source: Refreshing Rake Tasks
pt_br: Atualizando tarefas do Rake

source: Tests Completed: {0}
pt_br: Testes completados: {0}

source: Test Failures: {0}
pt_br: Testes com falha: {0}

source: Opposite file not found
pt_br: Arquivo oposto não encontrado

source: You should document your project here.
pt_br: Você deveria documentar seu projeto aqui.

source: Ruby Installation
pt_br: Instalação Ruby

source: Platform
pt_br: Plataforma

source: Choose a Ruby interpreter
pt_br: Escolha um interpretador Ruby

source: Choose the Ruby binary to be used:
pt_br: Escolha o binário do Ruby a ser utilizado:

source: Ruby &Interpreter:
pt_br: &Interpretador Ruby:

source: Welcome to the JRuby IRB Console
pt_br: Bem vido ao JRuby IRB Console

source: Run Project
pt_br: Executar projeto

source: Project {0} does not have a main class set.
pt_br: O projeto {0} não possui uma classe principal.

source: {0} class wasn''t found in {1} project.
pt_br: A classe {0} não foi localizada no projeto {1}.

source: Compile File
pt_br: Compilar arquivo

source: Run File
pt_br: Executar arquivo

source: Debug File
pt_br: Depurar arquivo

source: Click here to re-run task with tracing enabled
pt_br: Clique aqui para re-executar a tarefa com o rastreamento habilitado

source: &Resolve...
pt_br: &Resolver...

source: &Description:
pt_br: &Descrição:

source: Reference &Problems:
pt_br: &Problemas de referências:

source: "{0}" platform could not be found
pt_br: A plataforma "{0}" não pode ser localizada

source: "{0}" library could not be found
pt_br: A biblioteca "{0}" não pode ser localizada

source: "{0}" file/folder could not be found
pt_br: O arquivo/diretório "{0}" não pode ser localizado

source: "{0}" project could not be found
pt_br: O projeto "{0}"não pode ser localizado

source: Problem: The project uses the Java Platform called "{0}", but this platform was not found.
pt_br: Problema: O projeto utilizada a plataforma Java "{0}", entretanto esta plataforma não foi encontrada.

source: Solution: Click Resolve and create new platform called "{0}".
pt_br: Solução: Clique em Resolver e crie uma nava plataforma com o nome de "{0}".

source: Problem: The project uses a class library called "{0}", but this class library was not found.
pt_br: Problema: O projeto utiliza uma biblioteca chamada "{0}", entretanto esta biblioteca não foi localizada.

source: Solution: Click Resolve to open the Library Manager and create a new class library called "{0}".
pt_br: Solução: Clique em Resolver para abrir o gerenciador de bibliotecas e criar uma nova biblioteca com o nome de "{0}".

source: Problem: The project uses the class library called "{0}" but the classpath items of this library are missing.
pt_br: Problema: O projeto utiliza a biblioteca "{0}" mas os ítens desta bibliotecas estão faltando.

source: Solution: Click Resolve to open the Library Manager and locate the missing classpath items of "{0}" library.
pt_br: Solução: Clique em Resolver para abrir o gerenciador de bibliotecas e localizar os ítens que estão faltando na biblioteca "{0}".

source: Problem: The project uses the file/folder called "{0}", but this file/folder was not found.
pt_br: Problema: O projeto utiliza o arquivo/diretório "{0}", entretanto este arquivo/diretório não foi localizado.

source: Solution: Click Resolve and locate the missing file/folder.
pt_br: Solução: Clique em Resolver e localize o arquivo/diretório que está faltando.

source: Problem: The project classpath includes a reference to the project called "{0}", but this project was not found.
pt_br: Problema: O classpath do projeto inclui uma referência para o projeto "{0}", entretanto este projeto não foi localizado.

source: Solution: Click Resolve and locate the missing project.
pt_br: Solução: Clique em Resolver e localize o projeto que está faltando.

source: Resolve Reference Problems - "{0}" Project
pt_br: Resolver problemas de referências - Projeto "{0}"

source: Browse "{0}"
pt_br: Procurar "{0}"

source: Browse Project "{0}"
pt_br: Procurar projeto "{0}"

source: This problem was resolved
pt_br: Este problema foi resolvido

source: File &Name:
pt_br: &Nome do arquivo:

source: Tested &Class:
pt_br: &Classes testadas:

source: &Class:
pt_br: &Classe:

source: &In Module:
pt_br: &No módulo:

source: &Module:
pt_br: &Módulo:

source: &Extends:
pt_br: &Estende:

source: Fo&lder:
pt_br: &Diretório:

source: Bro&wse...
pt_br: &Procurar...

source: &Created File:
pt_br: Arquivo &criado:

source: &Created Folder:
pt_br: Diretório &criado:

source: &Project:
pt_br: &Projeto:

source: new_
pt_br: novo_

source: The File Name is not valid
pt_br: O nome do arquivo não é válido

source: Wrong source level of the project.
pt_br: O nível de código-fonte do projeto está errado.

source: You will NOT be able to compile this file since it contains JDK 1.5 features.
pt_br: Você NÃO poderá compilar este arquivo caso ele contenha características do JDK 1.5.

source: The Class Name is not valid
pt_br: O nome da classe está inválido

source: The Module Name is not valid
pt_br: O nome do módulo está inválido

source: The Superclass Name is not valid
pt_br: O nome da superclasse está inválido

source: The containing module name is not valid
pt_br: O nome do módulo que está contido não é válido

source: Choose Target Folder
pt_br: Escolha um diretório de destino

source: The target folder does not exist.
pt_br: O diretório de destino não existe.

source: The target folder is read-only.
pt_br: O diretório de destino é somente-leitura.

source: The file {0} already exists.
pt_br: O arquivo {0} já existe.

source: <html><b>Reference Problems</b></html>
pt_br: <html><b>Problemas de referências</b></html>

source: <html>One or more project resources could not be found.<br>Right-click the project in the Projects window and choose<br><b>Resolve Reference Problems</b> to find the missing resources.</html>
pt_br: <html>Um ou mais recursos não podem ser localizados.<br>Clique com o botão direito no projeto e na janela de Projetos escolha<br><b>Resolver problemas de referência</b> para encontrar os recursos que estão faltando.</html>

source: &Do not show this message again
pt_br: &Não mostre esta mensagem novamente

source: Do not show this message again
pt_br: Não mostre esta mensagem novamente

source: Broken References Panel
pt_br: Painel de referências inválidas

source: Broken References Customizer
pt_br: Personalizador de referências inválidas

source: Show RDoc
pt_br: Mostrar RDoc

source: RDoc for {0} not found.
pt_br: O RDoc para {0} não foi encontrado.

source: Creates a new Ruby RSpec specification.
pt_br: Cria uma nova especificação Ruby RSpec.

source: Creates a new Ruby Rakefile.
pt_br: Cria um Rakefile Ruby.

source: Ruby is a dynamic language.
pt_br: Ruby é uma linguagem dinâmica.

source: Rake is a build utility for Ruby similar to Make.
pt_br: Rake é um utilitário de construção para Ruby similar ao Make.

source: Creates a new Ruby unit test testcase.
pt_br: Cria um novo caso de teste para teste unitário Ruby.

source: Creates a new Ruby unit test suite, which can reference unit test cases.
pt_br: Cria uma nova suíte de teste unitário Ruby o qual pode referenciar casos de teste unitário.

source: The Ruby Application Projects.
pt_br: Projetos da aplicação Ruby.

source: Creates a new Ruby class.
pt_br: Cria uma nova classe Ruby.

source: Creates a new Ruby application in a standard IDE project.
pt_br: Cria uma nova aplicação Ruby no projeto padrão da IDE.

source: Creates a new Ruby module.
pt_br: Cria um novo módulo Ruby.

source: Ruby File
pt_br: Arquivo Ruby

source: Ruby Class
pt_br: Classe Ruby

source: Ruby Module
pt_br: Módulo Ruby

source: Ruby Unit Test
pt_br: Teste unitário Ruby

source: Ruby Unit Test Suite
pt_br: Suíte de teste unitário Ruby

source: RSpec File
pt_br: Arquivo RSpec

source: Other
pt_br: Outro

source: Creates a new Ruby file.
pt_br: Cria um novo arquivo Ruby.

source: Imports an existing Ruby application into a standard IDE project.
pt_br: Importa uma aplicação Ruby existente dentro do projeto padrão do IDE.

source: The Ruby application can have multiple source folders.
pt_br: A aplicação Ruby pode conter vários diretórios de código-fonte.

source: &Main Script:
pt_br: &Script principal:

source: (e.g. -v)
pt_br: (ex.: -v)

source: Rake Arguments:
pt_br: Argumentos do Rake:

source: Ruby Application
pt_br: Aplicação Ruby

source: Ruby Class Library
pt_br: Biblioteca de classe Ruby

source: Ruby Application with Existing Sources
pt_br: Aplicação Ruby com código-fonte existente

source: Ruby Project with Existing Sources
pt_br: Projeto Ruby com código-fonte existente

source: Creates new Java Application project
pt_br: Cria um novo projeto de aplicação Java

source: Creates new Java Class Library project
pt_br: Cria um novo projeto de biblioteca de classe Java

source: Creates new Java Project with Existing Sources
pt_br: Cria um novo projeto Java com código-fonte existente
